# NumberOfSolutions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs..::..NumberOfSolutions Property
FabricationPartBrowserChangedEventArgs Class See Also
---
The number of active solutions in routing solution mode.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int NumberOfSolutions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSolutions As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSolutions {
	int get ();
}
```

# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace